<?php
/**
 * Created by PhpStorm.
 * User: 彭泽龙
 * Date: 2016-4-12
 * Time: 11:10
 * 1,框架错误
 * 2,系统错误
 * 3,控制器错误
 * 4,模型错误
 * 5,视图错误
 * 6,服务器错误
 * 7,数据库错误
 * 8,函数方法错误
 *
 * @var 错误代码参考
 */
$error_code = array(
    0   => '',
    101 => '框架错误',
    201 => '系统错误',
    301 => '接口不存在',
    302 => 'access_token无效',
    303 => '签名不正确',
    304 => 'APPID或APPSecret不正确',
    305 => 'APPID已禁用',
    306 => '接口调用太频繁',
    401 => '模型不存在',
    404 => '请求的页面不存在',
    499 => '请求参数错误',
    501 => '方法参数缺失',
    502 => '非法参数',
    601 => '服务器错误',
    701 => '无法连接数据库',
    702 => '数据库不存在',
    703 => '查询数据库操作失败',
    704 => '数据库操作失败',
    705 => 'SQL生成器初始化错误',
    801 => '错误的服务协议',
    802 => '函数不存在',
    803 => '类不存在',
);
